## Exercises I

In [ ]:
# Run python -m pip install pymysql from your terminal to install pymysql.

# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

# Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
# cd into your exercises folder for this module and run echo env.py >> .gitignore
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [ ]:
# Use your function to obtain a connection to the employees database.

In [1]:
import numpy as np
import pandas as pd

from env import host, username, password

get_db_url = f'mysql+pymysql://{username}:{password}@{host}/employees'

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url)

In [ ]:
# Once you have successfully run a query:

In [2]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, get_db_url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [ ]:
# a. Intentionally make a typo in the database url. What kind of error message do you see?
# NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:msql.pymysql

# b. Intentionally make an error in your SQL query. What does the error message look like?
# 1054, "Unknown column 'mp_no' in 'field list'"

In [ ]:
# 6. Read the employees and titles tables into two separate DataFrames.

In [3]:
employees = pd.read_sql('select * from employees', get_db_url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [ ]:
titles = pd.read_sql('SELECT * FROM titles', get_db_url)
titles.head()

In [ ]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [ ]:
employees.shape

In [ ]:
titles.shape

In [ ]:
# 8. Display the summary statistics for each DataFrame.

In [ ]:
employees.describe()

In [ ]:
titles.describe()

In [ ]:
# 9. How many unique titles are in the titles DataFrame?

In [ ]:
titles.nunique()

In [ ]:
len(titles.title.unique())

In [ ]:
titles.title.value_counts()

In [ ]:
# 10. What is the oldest date in the to_date column?

In [ ]:
titles.to_date.min()

In [ ]:
# 11. What is the most recent date in the to_date column?

In [ ]:
most_recent = pd.read_sql('SELECT * FROM titles where to_date < now()', get_db_url)

In [ ]:
most_recent.sort_values(by = 'to_date', ascending = False).head(1)